; domain
(define (domain dron-strips)

    (:requirements :strips :typing)

    (:types 
        dron transportador caja persona localizacion contenido num
    )

    (:predicates
        (transportador-en ?t - transportador ?l - localizacion)
        (persona-en ?p - persona ?l - localizacion)
        (caja-en ?c - caja ?l - localizacion)
        (caja-en-dron ?c - caja ?d - dron)
        (dron-en ?d - dron ?l - localizacion)

        (persona-necesita ?p - persona ?ctn - contenido)
        (persona-tiene ?p - persona ?ctn - contenido)

        (caja-contiene ?c - caja ?ctn - contenido)
        (caja-disponible ?c - caja)

        (transportador-contiene ?t - transportador ?c - caja)
        (limite-de ?t - transportador ?n - num)
        (siguiente ?n1 - num ?n2 - num)

        (dron-tiene ?d - dron ?c - caja)
        (dron-libre ?d - dron)
    )

    (:action mover_dron
        :parameters (
            ?d - dron
            ?from - localizacion
            ?to - localizacion
        )
        :precondition (and 
            (dron-en ?d ?from)
        )
        :effect (and 
            (not (dron-en ?d ?from))
            (dron-en ?d ?to)
        )
    )

    (:action coger-caja
        :parameters (
            ?d - dron
            ?c - caja
            ?l - localizacion        
        )
        :precondition (and 
            (caja-en ?c ?l)
            (dron-en ?d ?l)
            (caja-disponible ?c)
            (dron-libre ?d)
        )
        :effect (and 
            (not (dron-libre ?d))
            (not (caja-en ?c ?l))
            (caja-en-dron ?c ?d)
            (dron-tiene ?d ?c)
        )
    )

    (:action dejar-caja
        :parameters (
            ?c - caja
            ?d - dron
            ?l - localizacion
        )
        :precondition (and 
            (dron-en ?d ?l)
            (dron-tiene ?d ?c)
            (caja-en-dron ?c ?d)
        )
        :effect (and 
            (not (dron-tiene ?d ?c))
            (not (caja-en-dron ?c ?d))
            (caja-en ?c ?l)
            (dron-libre ?d)
        )
    )

    (:action entregar-caja
        :parameters (
            ?c - caja
            ?d - dron
            ?l - localizacion
            ?ctn - contenido
            ?p - persona
        )
        :precondition (and 
            (dron-en ?d ?l)
            (dron-tiene ?d ?c)
            (persona-en ?p ?l)
            (caja-disponible ?c)
            (caja-en-dron ?c ?d)
            (caja-contiene ?c ?ctn)
        )
        :effect (and 
            (not (caja-en-dron ?c ?d))
            (not (dron-tiene ?d ?c))
            (not (persona-necesita ?p ?ctn))
            (persona-tiene ?p ?ctn)
            (dron-libre ?d)
        )
    )

    (:action poner-caja-en-transportador
        :parameters (
            ?c - caja
            ?d - dron
            ?t - transportador
            ?l - localizacion
            ?nant - num
            ?nsig - num
        )
        :precondition (and 
            (dron-en ?d ?l)
            (transportador-en ?t ?l)
            (caja-en-dron ?c ?d)
            (caja-disponible ?c)
            (limite-de ?t ?nant)
            (siguiente ?nant ?nsig)
        )
        :effect (and 
            (not (caja-en-dron ?c ?d))
            (not (dron-tiene ?d ?c))
            (not (limite-de ?t ?nant))
            (transportador-contiene ?t ?c)
            (limite-de ?t ?nsig)
            (dron-libre ?d)
        )
    )

    (:action coger-caja-de-transportador
        :parameters (
            ?c - caja
            ?d - dron
            ?t - transportador
            ?l - localizacion
            ?nant - num
            ?nact - num
        )
        :precondition (and 
            (dron-en ?d ?l)
            (transportador-en ?t ?l)
            (transportador-contiene ?t ?c)
            (dron-libre ?d)
            (caja-disponible ?c)
            (limite-de ?t ?nact)
        )
        :effect (and 
            (not (dron-libre ?d))
            (not (limite-de ?t ?nact))
            (not (transportador-contiene ?t ?c))
            (dron-tiene ?d ?c)
            (caja-en-dron ?c ?d)
            (limite-de ?t ?nant)
        )
    )

    (:action mover-transportador
        :parameters (
            ?t - transportador
            ?d - dron
            ?to - localizacion
            ?from - localizacion
        )
        :precondition (and 
            (dron-en ?d ?from)
            (transportador-en ?t ?from)
            (dron-libre ?d)
        )
        :effect (and 
            (not (transportador-en ?t ?from))
            (not (dron-en ?d ?from))
            (transportador-en ?t ?to)
            (dron-en ?d ?to)
        )
    )
)

; problem
(define (problem drone_problem_d1_r1_l10_p10_c10_g10_ct2)
(:domain dron-strips)
(:objects
	dron1 - dron
	deposito - localizacion
	loc1 - localizacion
	loc2 - localizacion
	loc3 - localizacion
	loc4 - localizacion
	loc5 - localizacion
	loc6 - localizacion
	loc7 - localizacion
	loc8 - localizacion
	loc9 - localizacion
	loc10 - localizacion
	caja1 - caja
	caja2 - caja
	caja3 - caja
	caja4 - caja
	caja5 - caja
	caja6 - caja
	caja7 - caja
	caja8 - caja
	caja9 - caja
	caja10 - caja
	comida - contenido
	medicina - contenido
	persona1 - persona
	persona2 - persona
	persona3 - persona
	persona4 - persona
	persona5 - persona
	persona6 - persona
	persona7 - persona
	persona8 - persona
	persona9 - persona
	persona10 - persona
	transportador1 - transportador
	n0 - num
	n1 - num
	n2 - num
	n3 - num
	n4 - num
)
(:init
	(dron-en dron1 deposito)
	(caja-en caja1 deposito)
	(caja-en caja2 deposito)
	(caja-en caja3 deposito)
	(caja-en caja4 deposito)
	(caja-en caja5 deposito)
	(caja-en caja6 deposito)
	(caja-en caja7 deposito)
	(caja-en caja8 deposito)
	(caja-en caja9 deposito)
	(caja-en caja10 deposito)
	(caja-disponible caja1 )
	(caja-disponible caja2 )
	(caja-disponible caja3 )
	(caja-disponible caja4 )
	(caja-disponible caja5 )
	(caja-disponible caja6 )
	(caja-disponible caja7 )
	(caja-disponible caja8 )
	(caja-disponible caja9 )
	(caja-disponible caja10 )
	(persona-en persona1 loc2)
	(persona-en persona2 loc6)
	(persona-en persona3 loc4)
	(persona-en persona4 loc5)
	(persona-en persona5 loc7)
	(persona-en persona6 loc10)
	(persona-en persona7 loc10)
	(persona-en persona8 loc7)
	(persona-en persona9 loc5)
	(persona-en persona10 loc10)
	(transportador-en transportador1 deposito)

	(caja-contiene caja1 comida)
	(caja-contiene caja2 medicina)
	(caja-contiene caja3 medicina)
	(caja-contiene caja4 medicina)
	(caja-contiene caja5 medicina)
	(caja-contiene caja6 medicina)
	(caja-contiene caja7 medicina)
	(caja-contiene caja8 medicina)
	(caja-contiene caja9 medicina)
	(caja-contiene caja10 medicina)

	(persona-necesita persona1 medicina)
	(persona-necesita persona2 medicina)
	(persona-necesita persona3 medicina)
	(persona-necesita persona4 medicina)
	(persona-necesita persona5 medicina)
	(persona-necesita persona6 medicina)
	(persona-necesita persona7 medicina)
	(persona-necesita persona8 comida)
	(persona-necesita persona8 medicina)
	(persona-necesita persona10 medicina)

	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)

	(limite-de transportador1 n0)

	(dron-libre dron1)
)
(:goal (and
	(persona-tiene persona1 medicina)
	(persona-tiene persona2 medicina)
	(persona-tiene persona3 medicina)
	(persona-tiene persona4 medicina)
	(persona-tiene persona5 medicina)
	(persona-tiene persona6 medicina)
	(persona-tiene persona7 medicina)
	(persona-tiene persona8 comida)
	(persona-tiene persona8 medicina)
	(persona-tiene persona10 medicina)

	(dron-en dron1 deposito)
	))
)

; plan
1. (coger-caja dron1 caja1 deposito)
   deleted: (dron-libre dron1) (caja-en caja1 deposito)
   added: (caja-en-dron caja1 dron1) (dron-tiene dron1 caja1)
   goals met: 1 of 11
2. (mover_dron dron1 deposito loc7)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc7)
   goals met: 0 of 11
3. (entregar-caja caja1 dron1 loc7 comida persona8)
   deleted: (caja-en-dron caja1 dron1) (dron-tiene dron1 caja1) (persona-necesita persona8 comida)
   added: (persona-tiene persona8 comida) (dron-libre dron1)
   goals met: 1 of 11
4. (mover_dron dron1 loc7 deposito)
   deleted: (dron-en dron1 loc7)
   added: (dron-en dron1 deposito)
   goals met: 2 of 11
5. (coger-caja dron1 caja10 deposito)
   deleted: (dron-libre dron1) (caja-en caja10 deposito)
   added: (caja-en-dron caja10 dron1) (dron-tiene dron1 caja10)
   goals met: 2 of 11
6. (mover_dron dron1 deposito loc2)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc2)
   goals met: 1 of 11
7. (entregar-caja caja10 dron1 loc2 medicina persona1)
   deleted: (caja-en-dron caja10 dron1) (dron-tiene dron1 caja10) (persona-necesita persona1 medicina)
   added: (persona-tiene persona1 medicina) (dron-libre dron1)
   goals met: 2 of 11
8. (mover_dron dron1 loc2 loc6)
   deleted: (dron-en dron1 loc2)
   added: (dron-en dron1 loc6)
   goals met: 2 of 11
9. (mover_dron dron1 loc6 deposito)
   deleted: (dron-en dron1 loc6)
   added: (dron-en dron1 deposito)
   goals met: 3 of 11
10. (coger-caja dron1 caja9 deposito)
   deleted: (dron-libre dron1) (caja-en caja9 deposito)
   added: (caja-en-dron caja9 dron1) (dron-tiene dron1 caja9)
   goals met: 3 of 11
11. (mover_dron dron1 deposito loc6)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc6)
   goals met: 2 of 11
12. (entregar-caja caja9 dron1 loc6 medicina persona2)
   deleted: (caja-en-dron caja9 dron1) (dron-tiene dron1 caja9) (persona-necesita persona2 medicina)
   added: (persona-tiene persona2 medicina) (dron-libre dron1)
   goals met: 3 of 11
13. (mover_dron dron1 loc6 loc4)
   deleted: (dron-en dron1 loc6)
   added: (dron-en dron1 loc4)
   goals met: 3 of 11
14. (mover_dron dron1 loc4 deposito)
   deleted: (dron-en dron1 loc4)
   added: (dron-en dron1 deposito)
   goals met: 4 of 11
15. (coger-caja dron1 caja8 deposito)
   deleted: (dron-libre dron1) (caja-en caja8 deposito)
   added: (caja-en-dron caja8 dron1) (dron-tiene dron1 caja8)
   goals met: 4 of 11
16. (mover_dron dron1 deposito loc4)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc4)
   goals met: 3 of 11
17. (entregar-caja caja8 dron1 loc4 medicina persona3)
   deleted: (caja-en-dron caja8 dron1) (dron-tiene dron1 caja8) (persona-necesita persona3 medicina)
   added: (persona-tiene persona3 medicina) (dron-libre dron1)
   goals met: 4 of 11
18. (mover_dron dron1 loc4 loc5)
   deleted: (dron-en dron1 loc4)
   added: (dron-en dron1 loc5)
   goals met: 4 of 11
19. (mover_dron dron1 loc5 deposito)
   deleted: (dron-en dron1 loc5)
   added: (dron-en dron1 deposito)
   goals met: 5 of 11
20. (coger-caja dron1 caja7 deposito)
   deleted: (dron-libre dron1) (caja-en caja7 deposito)
   added: (caja-en-dron caja7 dron1) (dron-tiene dron1 caja7)
   goals met: 5 of 11
21. (mover_dron dron1 deposito loc5)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc5)
   goals met: 4 of 11
22. (entregar-caja caja7 dron1 loc5 medicina persona4)
   deleted: (caja-en-dron caja7 dron1) (dron-tiene dron1 caja7) (persona-necesita persona4 medicina)
   added: (persona-tiene persona4 medicina) (dron-libre dron1)
   goals met: 5 of 11
23. (mover_dron dron1 loc5 loc7)
   deleted: (dron-en dron1 loc5)
   added: (dron-en dron1 loc7)
   goals met: 5 of 11
24. (mover_dron dron1 loc7 deposito)
   deleted: (dron-en dron1 loc7)
   added: (dron-en dron1 deposito)
   goals met: 6 of 11
25. (coger-caja dron1 caja6 deposito)
   deleted: (dron-libre dron1) (caja-en caja6 deposito)
   added: (caja-en-dron caja6 dron1) (dron-tiene dron1 caja6)
   goals met: 6 of 11
26. (mover_dron dron1 deposito loc7)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc7)
   goals met: 5 of 11
27. (entregar-caja caja6 dron1 loc7 medicina persona5)
   deleted: (caja-en-dron caja6 dron1) (dron-tiene dron1 caja6) (persona-necesita persona5 medicina)
   added: (persona-tiene persona5 medicina) (dron-libre dron1)
   goals met: 6 of 11
28. (mover_dron dron1 loc7 deposito)
   deleted: (dron-en dron1 loc7)
   added: (dron-en dron1 deposito)
   goals met: 7 of 11
29. (coger-caja dron1 caja5 deposito)
   deleted: (dron-libre dron1) (caja-en caja5 deposito)
   added: (caja-en-dron caja5 dron1) (dron-tiene dron1 caja5)
   goals met: 7 of 11
30. (mover_dron dron1 deposito loc7)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc7)
   goals met: 6 of 11
31. (entregar-caja caja5 dron1 loc7 medicina persona8)
   deleted: (caja-en-dron caja5 dron1) (dron-tiene dron1 caja5) (persona-necesita persona8 medicina)
   added: (persona-tiene persona8 medicina) (dron-libre dron1)
   goals met: 7 of 11
32. (mover_dron dron1 loc7 loc10)
   deleted: (dron-en dron1 loc7)
   added: (dron-en dron1 loc10)
   goals met: 7 of 11
33. (mover_dron dron1 loc10 deposito)
   deleted: (dron-en dron1 loc10)
   added: (dron-en dron1 deposito)
   goals met: 8 of 11
34. (coger-caja dron1 caja4 deposito)
   deleted: (dron-libre dron1) (caja-en caja4 deposito)
   added: (caja-en-dron caja4 dron1) (dron-tiene dron1 caja4)
   goals met: 8 of 11
35. (mover_dron dron1 deposito loc10)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc10)
   goals met: 7 of 11
36. (entregar-caja caja4 dron1 loc10 medicina persona6)
   deleted: (caja-en-dron caja4 dron1) (dron-tiene dron1 caja4) (persona-necesita persona6 medicina)
   added: (persona-tiene persona6 medicina) (dron-libre dron1)
   goals met: 8 of 11
37. (mover_dron dron1 loc10 deposito)
   deleted: (dron-en dron1 loc10)
   added: (dron-en dron1 deposito)
   goals met: 9 of 11
38. (coger-caja dron1 caja3 deposito)
   deleted: (dron-libre dron1) (caja-en caja3 deposito)
   added: (caja-en-dron caja3 dron1) (dron-tiene dron1 caja3)
   goals met: 9 of 11
39. (mover_dron dron1 deposito loc10)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc10)
   goals met: 8 of 11
40. (entregar-caja caja3 dron1 loc10 medicina persona7)
   deleted: (caja-en-dron caja3 dron1) (dron-tiene dron1 caja3) (persona-necesita persona7 medicina)
   added: (persona-tiene persona7 medicina) (dron-libre dron1)
   goals met: 9 of 11
41. (mover_dron dron1 loc10 deposito)
   deleted: (dron-en dron1 loc10)
   added: (dron-en dron1 deposito)
   goals met: 10 of 11
42. (coger-caja dron1 caja2 deposito)
   deleted: (dron-libre dron1) (caja-en caja2 deposito)
   added: (caja-en-dron caja2 dron1) (dron-tiene dron1 caja2)
   goals met: 10 of 11
43. (mover_dron dron1 deposito loc10)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc10)
   goals met: 9 of 11
44. (entregar-caja caja2 dron1 loc10 medicina persona10)
   deleted: (caja-en-dron caja2 dron1) (dron-tiene dron1 caja2) (persona-necesita persona10 medicina)
   added: (persona-tiene persona10 medicina) (dron-libre dron1)
   goals met: 10 of 11
45. (mover_dron dron1 loc10 deposito)
   deleted: (dron-en dron1 loc10)
   added: (dron-en dron1 deposito)
   goals met: 11 of 11
